Repository: dnganhkiet1206/fitness-os
Catalog: apps/ios/ASCND/Resources/Localizable.xcstrings
Source language: en
Languages: es, vi

# foods.a11y.save %@
source: Save %@ to my foods
es: Guardar %@ en mis alimentos
vi: Lưu %@ vào thực phẩm của tôi

# foods.addTitle
source: Add Food Item
es: Añadir alimento
vi: Thêm Thực Phẩm

# foods.editTitle
source: Edit Food Item
es: Editar alimento
vi: Chỉnh Sửa Thực Phẩm

# foods.name
source: Food name
es: Nombre del alimento
vi: Tên thực phẩm

# foods.name.placeholder
source: e.g. Chicken breast, Rice...
es: p. ej., pechuga de pollo, arroz...
vi: VD: Ức gà, Cơm trắng...

# foods.brand
source: Brand
es: Marca
vi: Thương hiệu

# foods.brand.placeholder
source: e.g. Kirkland, Optimum...
es: p. ej., Kirkland, Optimum...
vi: VD: CP, Vinamilk...

# foods.serving
source: Serving size
es: Tamaño de porción
vi: Khẩu phần

# foods.calories
source: Calories
es: Calorías
vi: Calo

# foods.autoCalc %@
source: Auto-calc (%@)
es: Autocalcular (%@)
vi: Tự tính (%@)

# foods.fiber
source: Fiber
es: Fibra
vi: Chất xơ

# foods.outOfRange
source: Calories must be 0–10000 and each nutrient 0–2000 g
es: Las calorías deben estar entre 0 y 10000 y cada nutriente entre 0 y 2000 g
vi: Calo phải trong 0–10000, mỗi chất trong 0–2000 g

# foods.delete
source: Delete
es: Eliminar
vi: Xoá

# foods.delete.confirm %@
source: Delete "%@"?
es: ¿Eliminar "%@"?
vi: Xoá "%@"?

# foods.added
source: Food added!
es: ¡Alimento añadido!
vi: Đã thêm thực phẩm!

# foods.updated
source: Updated!
es: ¡Alimento actualizado!
vi: Đã cập nhật!

# foods.deleted
source: Food deleted!
es: ¡Alimento eliminado!
vi: Đã xoá thực phẩm!

# foods.error.onlineOnly
source: You're offline — editing foods needs a connection.
es: Sin conexión: editar alimentos necesita internet.
vi: Bạn đang ngoại tuyến — sửa thực phẩm cần có mạng.

# foods.error.nothingWritten
source: Couldn't save this food — it may have been deleted on another device.
es: No se pudo guardar este alimento; quizá se eliminó en otro dispositivo.
vi: Không lưu được món này — có thể nó đã được xoá ở thiết bị khác.

# insights.title
source: 7-day nutrition
es: Nutrición de 7 días
vi: Dinh dưỡng 7 ngày

# insights.link
source: View 7-day trends
es: Ver tendencias de 7 días
vi: Xem xu hướng 7 ngày

# insights.empty
source: No data yet
es: Sin datos aún
vi: Chưa có dữ liệu

# insights.empty.hint
source: Log meals for a few days to see trends here.
es: Registra comidas durante unos días para ver tendencias aquí.
vi: Ghi bữa ăn vài ngày để xem xu hướng ở đây.

# insights.proteinCaption %@
source: Avg protein/day · target %@g
es: Proteína promedio/día · objetivo %@g
vi: Protein trung bình/ngày · mục tiêu %@g

# insights.proteinTitle
source: Protein, last 7 days
es: Proteína, últimos 7 días
vi: Protein 7 ngày qua

# insights.head
source: Insights
es: Comentarios
vi: Nhận xét

# insights.a11y.hit %@
source: %@ g, target reached
es: %@ g, objetivo alcanzado
vi: %@ g, đạt mục tiêu

# insights.a11y.miss %@
source: %@ g, below target
es: %@ g, por debajo del objetivo
vi: %@ g, dưới mục tiêu

# insights.proteinGap %lld %lld %lld
source: Averaging %1$lldg protein/day, %2$lldg short of your %3$lldg target.
es: Promedio de %1$lldg de proteína/día, %2$lldg por debajo de tu objetivo de %3$lldg.
vi: Protein trung bình %1$lldg/ngày, thiếu %2$lldg so với mục tiêu %3$lldg.

# insights.proteinHit %lld %lld
source: Hit your protein target %1$lld/%2$lld days — keep it up!
es: Alcanzaste tu objetivo de proteína %1$lld/%2$lld días — ¡sigue así!
vi: Đạt mục tiêu protein %1$lld/%2$lld ngày — giữ vững!

# insights.fiberLow %lld %lld
source: Averaging %1$lldg fiber, well under your %2$lldg target. Add vegetables or oats to breakfast.
es: Promedio de %1$lldg de fibra, muy por debajo de tu objetivo de %2$lldg. Añade verduras o avena al desayuno.
vi: Chất xơ trung bình %1$lldg, thấp hơn nhiều so với mục tiêu %2$lldg. Thêm rau hoặc yến mạch vào bữa sáng.

# plans.title
source: Meal Plans
es: Planes de comidas
vi: Kế hoạch ăn

# plans.empty
source: No meal plans yet
es: Aún no hay planes de comidas
vi: Chưa có kế hoạch ăn

# plans.what
source: A meal plan is a week of meals you set up ahead. Open a day, tap “Log to today”, and that meal goes into today’s diary.
es: Un plan de comidas es una semana de comidas que preparas con antelación. Abre un día, toca “Registrar hoy” y esa comida pasa al diario de hoy.
vi: Kế hoạch ăn là một tuần các bữa bạn soạn trước. Mở một ngày, chạm “Ghi vào hôm nay” là bữa đó vào nhật ký hôm nay.

# plans.create
source: Create Meal Plan
es: Crear plan de comidas
vi: Tạo kế hoạch ăn

# plans.new
source: New meal plan
es: Nuevo plan de comidas
vi: Kế hoạch ăn mới

# plans.mealsPerDay %lld
source: %lld meals/day
es: %lld comidas/día
vi: %lld bữa/ngày

# plans.a11y.filled %lld
source: %lld of 7 days planned
es: %lld de 7 días planificados
vi: Đã lên món %lld trên 7 ngày

# plans.goal.bulk
source: Bulk
es: Volumen
vi: Tăng cân

# plans.goal.cut
source: Cut
es: Definición
vi: Giảm cân

# plans.goal.maintain
source: Maintain
es: Mantenimiento
vi: Duy trì

# plans.goal
source: Goal
es: Objetivo
vi: Mục tiêu

# plans.name
source: Plan name
es: Nombre del plan
vi: Tên kế hoạch ăn

# plans.name.placeholder
source: e.g. Meal Prep Week 1
es: p. ej. Meal Prep Semana 1
vi: VD: Meal Prep Tuần 1

# plans.name.hint
source: A name you will recognise in the list.
es: Un nombre que reconozcas en la lista.
vi: Một cái tên bạn nhận ra trong danh sách.

# plans.mealsPerDayLabel
source: Meals per day
es: Comidas al día
vi: Số bữa/ngày

# plans.preview
source: What you will get
es: Lo que obtendrás
vi: Sẽ tạo ra

# plans.previewSum %lld %lld %lld
source: %1$lld days · %2$lld meals a day · %3$lld meals in total
es: %1$lld días · %2$lld comidas al día · %3$lld comidas en total
vi: %1$lld ngày · %2$lld bữa mỗi ngày · tổng %3$lld bữa

# plans.error.onlineOnly
source: You are offline — meal plans change only with a connection.
es: Estás sin conexión — los planes de comidas solo cambian con conexión.
vi: Bạn đang ngoại tuyến — kế hoạch ăn chỉ sửa được khi có mạng.

# plans.error.itemGone
source: Could not delete this item from the meal plan
es: No se pudo eliminar este alimento del plan
vi: Không xoá được món trong kế hoạch ăn

# plans.error.planGone
source: Could not delete this meal plan
es: No se pudo eliminar este plan de comidas
vi: Không xoá được kế hoạch ăn này

# plans.delete
source: Delete meal plan
es: Eliminar plan de comidas
vi: Xoá kế hoạch ăn

# plans.delete.confirm %@
source: Delete “%@” and every food in it?
es: ¿Eliminar “%@” y todos sus alimentos?
vi: Xoá “%@” cùng mọi món trong đó?

# plans.again.title
source: Already in today
es: Ya está en hoy
vi: Hôm nay đã có rồi

# plans.again.body %@
source: Today already has a %@ with exactly these foods. Log it a second time?
es: Hoy ya hay un/a %@ con exactamente estos alimentos. ¿Registrarlo otra vez?
vi: Nhật ký hôm nay đã có một bữa %@ đúng các món này. Ghi thêm lần nữa?

# plans.again.yes
source: Log again
es: Registrar otra vez
vi: Ghi thêm

# plans.dayEmpty
source: Nothing planned for this day yet.
es: Aún no hay nada planificado para este día.
vi: Ngày này chưa có món nào.

# plans.addFood
source: Add food
es: Añadir alimento
vi: Thêm món

# plans.a11y.addFood %lld
source: Add food to day %lld
es: Añadir alimento al día %lld
vi: Thêm món vào ngày %lld

# plans.day %lld
source: Day %lld
es: Día %lld
vi: Ngày %lld

# plans.pctTarget %lld
source: %lld%% of target
es: %lld%% del objetivo
vi: %lld%% mục tiêu

# plans.weekTotal %@
source: %@ kcal across the week
es: %@ kcal en la semana
vi: %@ kcal cả tuần

# plans.eatIt
source: Log to today
es: Registrar hoy
vi: Ghi vào hôm nay

# plans.eaten
source: In today
es: En hoy
vi: Có trong hôm nay

# plans.a11y.remove %@
source: Remove %@
es: Quitar %@
vi: Bỏ %@

# plans.eatDone %@
source: %@ added to today’s diary
es: %@ añadido al diario de hoy
vi: Đã thêm %@ vào nhật ký hôm nay

# plans.eatQueued %@
source: %@ saved — will sync when you are back online
es: %@ guardado — se sincronizará cuando vuelvas a tener conexión
vi: Đã lưu %@ — sẽ đồng bộ khi có mạng

# plans.step.day
source: Day
es: Día
vi: Ngày

# plans.step.dayHint
source: Which day of the week this food is for.
es: Para qué día de la semana es este alimento.
vi: Món này cho ngày nào trong tuần.

# plans.step.meal
source: Meal
es: Comida
vi: Bữa

# plans.step.mealHint
source: Which meal of that day.
es: Qué comida de ese día.
vi: Bữa nào của ngày đó.

# plans.step.food
source: Food
es: Alimento
vi: Món

# plans.step.foodHint
source: Search, or pick from your list. Tap as many as you like.
es: Busca o elige de tu lista. Toca tantos como quieras.
vi: Tìm, hoặc chọn từ danh sách của bạn. Chạm bao nhiêu món cũng được.

# plans.noMatch %@
source: No food matches “%@”
es: Ningún alimento coincide con “%@”
vi: Không có món nào khớp “%@”

# plans.fromList
source: From your list
es: De tu lista
vi: Từ danh sách của bạn

# plans.a11y.inMeal
source: Already in this meal
es: Ya está en esta comida
vi: Đã có trong bữa này

# plans.done
source: Done
es: Listo
vi: Xong

# plans.doneAdded %lld
source: Done · %lld added
es: Listo · %lld añadidos
vi: Xong · đã thêm %lld

# diary.item.pending
source: Waiting to sync — can be edited once it reaches the server
es: Pendiente de sincronizar — se podrá editar cuando llegue al servidor
vi: Đang chờ đồng bộ — sửa được khi đã lên máy chủ

# diary.error.pendingSync
source: This food is still waiting to sync. Edit or delete it once it has been sent.
es: Este alimento aún está pendiente de sincronizar. Edítalo o elimínalo cuando se haya enviado.
vi: Món này còn đang chờ đồng bộ. Gửi xong mới sửa hoặc xoá được.

# xi.reps.one
source: 1 rep
vi: 1 reps

# sd.minutes
source: min (est.)
vi: phút (ước lượng)

# rd.unit.ratio
source: ratio
vi: tỉ số

# bio.part.resp %@
source: Resp %@
vi: Thở %@

# metric.note.normal
source: Normal
vi: Bình thường

# community.minutes %@
source: ~%@ min
vi: ~%@ phút

# community.reason.spam
source: Spam
vi: Nội dung rác

# ex.name.placeholder
source: e.g. Bench Press
vi: VD: Bench Press

# muscle.cardio
source: Cardio
vi: Tim mạch
